Enums/ШагЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ШагЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
					<Comment>0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеВРаботу</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ШагЗадачи/Ext/ManagerModule.bsl
Функция ПолучитьПредыдущийШагЗадачи(шаг) Экспорт
	Возврат ПолучитьНомерТекШага(шаг, "назад");	
КонецФункции

Функция ПолучитьСледующийШагЗадачи(шаг) Экспорт
	Возврат ПолучитьНомерТекШага(шаг, "вперед");
КонецФункции

Функция ПолучитьНомерТекШага(шаг, направление) 
	индексШага = Перечисления[шаг.Метаданные().имя].Индекс(шаг);
	шагИмя = Метаданные.Перечисления[шаг.Метаданные().имя].ЗначенияПеречисления[индексШага].Имя;
	шагСтруктура = Новый Структура("Корректировка,ПринятиеВРаботу,Исполнение,Завершение,Отказ", 0,1,2,3,4);	
	
	шагМассив = Новый Массив();
	шагМассив.Добавить("Корректировка");
	шагМассив.Добавить("ПринятиеВРаботу");
	шагМассив.Добавить("Исполнение");
	шагМассив.Добавить("Завершение");
	шагМассив.Добавить("Отказ");
	
	Если направление = "вперед" Тогда
		направление = ?(шагСтруктура[шагИмя] + 1 > 6, 6, шагСтруктура[шагИмя] + 1);
	Иначе
		направление = ?(шагСтруктура[шагИмя] - 1 < 0, 0, шагСтруктура[шагИмя] - 1);
	КонецЕсли;
	
	Возврат Перечисления.ШагЗадачи[ шагМассив[направление] ];
КонецФункции
